<template>
<section id="detail">
  <router-view name="nav" :season="currentSeason"></router-view>
  <router-view name="content" :solar="currentSolar" :seasonId="currentSeason.id"></router-view>
</section>
</template>

<script>
import {getMousewheelDirection} from '@/util';
export default {
  data () {
    return {
      currentSeason: null,  //传给nav
      currentSolar: null,   //传给content
      spring: {
        id: 0,
        solar: [
          {name: '立春',
            active: false,
            id: 0,
            pinyin: '[lì chūn]',
            time: '2017年2月03日',
            intro: `立春是农历二十四节气中的第一个节气。“立”是“开始”的意思，自秦代以来，中国就一直以立春作为孟春时节的开始。同时立春是从天文上来划分的，春意味着风和日暖，鸟语花香;春也意味着万物生长，农家播种。
  中国传统将立春分为三候：“一候东风解冻，二候蜇虫始振，三候鱼陟负冰”，说的是东风送暖，大地开始解冻。立春五日后，蛰居的虫类慢慢在洞中苏醒，再过五日，河里的冰开始溶化，鱼开始到水面上游动，此时水面上还有没完全溶解的碎冰片，如同被鱼负着一般浮在水面。`,
            three: ['东风解冻', '蛰虫始振', '鱼陟负冰'],
            detail: [
              `立春养生六大原则
1.  早起早睡以养肝
2.  不要过早减衣
3.  防止旧病复发
4.  每天梳头百下
5.  多吃韭菜香菜
6.  少吃补品和盐`,
              '立春作为春季的开始，"律回岁晚冰霜少，春到人间草木知"，形象地反映出立春时节的自然特色。时至立春，人们明显地感觉到白天长了，太阳也暖和多了，气温、日照、降水趋于上升或增多。虽然春日渐暖，但因天气的变化仍然无常，防寒防冰还是必要的',
              `春夜喜雨
[唐]杜甫
好雨知时节，当春乃发生。
随风潜入夜，润物细无声。
野径云俱黑，江船火独明。
晓看红湿处，花重锦官城。
`,
              '农谚提醒人们“立春雨水到，早起晚睡觉”，大春备耕也开始了。虽然立了春，但是华南大部分地区仍是很冷。在安排农业生产时应该考虑到立春的气候特点，农村要抓紧对越冬作物的田间管理，中耕松土，追施返青肥，防冻保苗。'
            ]
          },
          {name: '雨水',
            active: false,
            id: 1,
            pinyin: '[yǔ shuǐ]',
            time: '2017年2月18日',
            intro: `雨水，表示降水开始，雨量逐步增多。雨水，表示两层意思，一是天气回暖，降水量逐渐增多了，二是在降水形式上，雪渐少了，雨渐多了。
            我国古代将雨水分为三候：“一候獭祭鱼；二候鸿雁来；三候草木萌动。”此节气，水獭开始捕鱼了，将鱼摆在岸边如同先祭后食的样子；五天过后，大雁开始从南方飞回北方；再过五天，在“润物细无声”的春雨中，草木随地中阳气的上腾而开始抽出嫩芽。从此，大地渐渐开始呈现出一派欣欣向荣的景象。`,
            three: ['獭祭鱼', '候雁北', '草木萌动'],
            detail: [
              `在雨水节气之后，随着降雨有所增多，寒湿之邪最易困着脾脏。同时湿邪留恋，难以去除，故雨水前后应当着重养护脾脏。其次，要注意健脾利湿。内以养护脾气，外以清利湿邪，从而达到养脾的目的。雨水时节，还要预防“倒春寒”，春寒料峭，湿气一般夹“寒”而来，因此雨水前后必须注意保暖，切勿受凉。同时少食生冷之物。`,
              '雨水不仅表明降雨的开始及雨量增多，而且表示气温的升高。雨水前，天气相对来说比较寒冷。雨水后，人们则明显感到春回大地，春暖花开和春满人间，沁人的气息激励着身心。全国大部分地区严寒多雪之时已过，下雨开始，雨量渐渐增多。',
              `初春小雨\n[唐]韩愈\n天街小雨润如酥，\n草色遥看近却无。\n最是一年春好处，\n绝胜烟柳满皇都。`,
              '雨水时节正是嫁接果木，植树造林的时候。华南继冬干之后，又常年多春旱，特别是华南西部更是“春雨贵如油”。因此农业上要注意保墒，及时浇灌，以满足小麦拔节孕穗、油菜抽苔开花需水关键期的水分供应。'
            ]
          },
          {name: '惊蛰',
            active: false,
            id: 2,
            pinyin: '[jīng zhé]',
            time: '2017年3月05日',
            intro: `惊蛰的意思是天气回暖，春雷始鸣，惊醒蛰伏于地下冬眠的昆虫。“蛰”是藏的意思。《月令七十二候集解》中说：“二月节，万物出乎震，震为雷，故曰惊蛰。是蛰 虫惊而出走矣。”我国古代将惊蛰分为三候：“一候桃始华；二候仓庚（黄鹂）鸣；三候鹰化为鸠。”描述已是进入仲春，桃花红、梨花白，黄莺鸣叫、燕飞来的时节。按照一般气侯 规律，惊蛰前后各地天气已开始转暖，雨水渐多，大部分 地区都已进入了春耕。惊醒了蛰伏在泥土中冬眠的各种昆虫的时候，此时过冬的虫卵也要开始卵化。由此可见惊蛰是反映自然物候现象的一个节气。`,
            three: ['桃始华', '仓庚鸣', '鹰化为鸠'],
            detail: [
              `春季与肝相应，如养生不当则可伤肝。惊蛰时节，属肝病高发季节，流感、流脑、水痘、带状疱疹、流行性出血热等在这一节气都易流行爆发，因此要严防此类疾病。除此之外，精神上要保持愉快、心平气和的良好心态，切忌妄动肝火，否则肝气太盛，易患头晕、目眩、中风和精神疾患。`,
              '惊蛰时节，我国除东北、西北地区仍是银妆素裹的冬日景象外，其他大部分地区平均气温已升到0℃以上，华北地区日平均气温为3—6℃，江南地区为8℃以上，而西南和华南还达10—15℃，早已是一派融融的春光了。',
              `惊蛰\n[现代]吴藕汀\n杏花村酒寄千程，\n佳果满前莫问名。\n惊蛰未闻雷出地，\n丰收有望看春耕。`,
              '惊蛰节气时期，华北冬小麦开始返青生长，土壤仍冻融交替，及时耙地是减少水分蒸发的重要措施。沿江江南小麦已经拔节，油菜也开始见花，对水、肥的要求均很高，应适时追肥，干旱少雨的地方应适当浇水灌溉。华南地区早稻播种应抓紧进行，同时要做好秧田防寒工作。'
            ]
          },
          {name: '春分',
            active: false,
            id: 3,
            pinyin: '[chūn fēn]',
            time: '2017年3月20日',
            intro: `春分，古时又称为“日中”、“日夜分”、“仲春之月”。《明史·历一》说：“分者，黄赤相交之点，太阳行至此，乃昼夜平分。”所以，春分的意义，一是指一天时间白天黑夜平分，各为12小时；二是古时以立春至立夏为春季，春分正当春季三个月之中，平分了春季。同时春分也是节日和祭祀庆典，古代帝王有春天祭日，秋天祭月的礼制。
            中国古代将春分分为三候：“一候元鸟至；二候雷乃发声；三候始电。”便是说春分日后，燕子便从南方飞来了，下雨时天空便要打雷并发出闪电。`,
            three: ['玄鸟至', '雷乃发声', '始电'],
            detail: [
              `由于春分这天正好昼夜平分，阴阳各半，此时的节气特点是阴阳平衡，故养生也要顺应此时的节气特点，要讲求“平和”，以和为贵，以平为期。要注意精神保持心平气和；起居方面要多晒太阳；饮食则要戒酸增辛。`,
              '春分节气，东亚大槽明显减弱，西风带槽脊活动明显增多，蒙古到东北地区常有低压活动和气旋发展，低压移动引导冷空气南下，北方地区多大风和扬沙天气。当长波槽东移，受冷暖气团交汇影响，会出现连续阴雨和倒春寒天气。',
              `春分 七绝·苏醒
[南唐]徐铉
春分雨脚落声微，
柳岸斜风带客归。
时令北方偏向晚，
可知早有绿腰肥。`,
              '俗话讲：“春分麦起身，肥水要紧跟”。一场春雨一场暖，春雨过后忙耕田。春季大忙季节就要开始了，春管、春耕、春种即将进入繁忙阶段。春分过后，越冬作物进入生长阶段，要加强田间管理。由于气温回升快，需水量相对较大，因此要加强蓄水保墒。'
            ]
          },
          {name: '清明',
            active: false,
            id: 4,
            pinyin: '[qīng míng]',
            time: '2017年4月04日',
            intro: `清明，夏历二十四节气之一。在春分之后，谷雨之前。《历书》：“春分后十五日，斗指丁，为清明，时万物皆洁齐而清明，盖时当（气温上升，中国南部雾气少，北部风沙消失，空气通透性好），因此得名。”
清明有三候：“ 一候桐始华；二候田鼠化为鹌；三候虹始见。”意思是在这个时节先是白桐花开放，接着喜阴的田鼠不见了，全回到了地下的洞中，然后是雨后的天空可以见到彩虹了。`,
            three: ['桐始华', '田鼠化为鴽', '虹始见'],
            detail: [
              `关于清明养生，要注意四个方面：一是从起卧时间上做起，尽量做到夜卧早起；二是防止肝气过旺，对脾胃产生不良影响；三是选择具有疏散风热、清肝明目功效的菊花茶饮用，可以养肝利胆、疏通经脉 ；四是要预防流行病，如感冒与腹泻。`,
              '清明是表征物候的节气，含有天气晴朗、草木繁茂的意思。常言道：“清明断雪，谷雨断霜。”时至清明，华南气候温暖，春意正浓。但在清明前后，仍然时有冷空气入侵，甚至使日平均气温连续3天以上低于12℃。',
              `清明
[唐]杜牧
清明时节雨纷纷，
路上行人欲断魂。
借问酒家何处有?
牧童遥指杏花村。`,
              '清明时节，根据其气候特点，在黄淮以南要注意小麦孕穗、油菜盛花；在东北与西北则注意小麦拔节；而在北方与江南就要旱作播种、早中稻播种；还有西南地区要开始中稻、玉米、甘薯播种。不仅如此，还要做好肥水管理与病虫害防治以及苗床防冻保暖、通风换气。'
            ]
          },
          {name: '谷雨',
            active: false,
            id: 5,
            pinyin: '[gǔ yǔ]',
            time: '2017年4月20日',
            intro: `谷雨是“雨生百谷”的意思，每年4月20日或21日太阳到达黄经30°时为谷雨。《月令七十二候集解》中说，“三月中，自雨水后，土膏脉动，今又雨其谷于水也……盖谷以此时播种，自下而上也”，故此得名。谷雨是春季的最后一个节气。
中国古代将谷雨分为三候：“第一候萍始生；第二候呜鸠拂其羽；第三候为戴任降于桑。”是说谷雨后降雨量增多，浮萍开始生长，接着布谷鸟便开始提醒人们播种了，然后是桑树上开始见到戴胜鸟。`,
            three: ['萍始生', '鸣鸠拂其羽', '戴胜降于桑'],
            detail: [
              `谷雨时节，脾处于旺盛时期。脾的旺盛会使胃强健起来，从而使消化功能处于旺盛的状态，消化功能旺盛有利于营养的吸收，正是补身的大好时机。且谷雨节气气温偏高，雨水频繁，蛇蚁蚊虫的繁殖和活动也变得频繁，外出尽量穿长衣长裤，喷抹驱蚊水，以免被叮咬。`,
              '　谷雨节气，南方的气温升高较快，一般4月下旬平均气温，除了华南北部和西部部分地区外，已达20℃至22℃，比中旬增高2℃以上。华南东部常会有一、二天出现30以上的高温，使人开始有炎热之感。低海拔河谷地带业以进入夏季。华南春季气温较高的气候特点。',
              `谷雨
[现代]左河水
雨频霜断气清和，
柳绿茶香燕弄梭。
布谷啼播春暮日，
栽插种管事诸多。`,
              '谷雨后雨水增多，给春季恢复生长的作物提供了充沛的水分，也给春耕春种创造了条件。这时节正好是早稻插秧和棉花、春玉米等作物播种的大好季节，要适时插好早稻，抢晴播种棉花、春玉米，同时要防止作物病害，做好春蚕养前准备。'
            ]
          }
        ]
      },
      summer: {
        id: 1,
        solar: [
          {name: '立夏',
            active: false,
            id: 6,
            pinyin: '[lì xià]',
            time: '2017年5月05日',
            intro: `立夏是夏季的第一个节气，表示孟夏时节的正式开始，太阳到达黄经45度时为立夏节气。斗指东南，维为立夏，万物至此皆长大，故名立夏也。
中国古代将谷雨分为三候：“一候蝼蝈鸣；二候蚯蚓出；三候王瓜生。”即说这一节气中首先可听到蜊蜊（即：蝼蛄）蛄在田间的呜叫声（一说是蛙声），接着大地上便可看到蚯蚓掘土，然后王瓜的蔓藤开始快速攀爬生长。`,
            three: ['蝼蝈鸣', '蚯蚓出', '王瓜生'],
            detail: [
              `立夏时节，人们易感到烦躁不安，易出现失眠、口腔溃疡等上火症状。立夏养生，首先要养心，要做到戒躁戒怒，切忌大喜大悲，要保持精神安静，心志安闲，心情舒畅，笑口常开。同时可注意以下三点：一是食物可以增酸为主；二是重视午休；三是多运动按摩。`,
              '立夏时节我国南北的气温差异较大，而且同一地区波动频繁，华南其余的地区气温为20℃左右；而低海拔河谷则早在4月中旬初即感夏热，立夏时气温已达24℃以上。立夏以后，江南正式进入雨季，雨量和雨日均明显增多，连绵的阴雨不仅导致作物的湿害。',
              `立夏
[现代]左河水
南国似暑北国春，
绿秀江淮万木荫。
时病时虫人撒药，
忽寒忽热药搪人。`,
              '立夏时节，小麦齐穗，开始养花上浆。农谚有“立夏不出头，割了喂老牛”、“立夏麦挑旗，小满麦秀齐”。此时各种侯鸟相继入境，红薯芽普遍移栽下地，并继续播种旱秋作物，黄瓜成熟。农谚有“四月八，鲜黄瓜”，“立夏种棉花，有苗无疙瘩”。'
            ]
          },
          {name: '小满',
            active: false,
            id: 7,
            pinyin: '[xiǎo mǎn]',
            time: '2017年5月21日',
            intro: `小满是夏季第二个节气。《月令七十二候集解》记载：“四月中，小满者，物致于此小得盈满。”这时全国北方地区麦类等夏熟作物籽粒已开始饱满，但还没有成熟，所以叫小满。
中国古代将小满分为三候： “一候苦菜秀；二候靡草死；三候麦秋至。”是说小满节气中，苦菜已经枝叶繁茂；而喜阴的一些枝条细软的草类在强烈的阳光下开始枯死；此时麦子开始成熟。`,
            three: ['苦菜秀', '靡草死', '麦秋至'],
            detail: [
              `小满时节，万物繁茂，生长最旺盛，人体的生理活动也处于最旺盛的时期，消耗的营养物质在四季二十四节气中最多，所以此时应及时适当补充营养，使身体五脏六腑不受损伤。同时可注意以下几点——宜健脾祛湿、防热病湿疹、忌心神不宁以及午睡勿贪凉。`,
              '小满时节，南方地区降雨多、雨量大；长江中下游地区雨水偏少，可能是太平洋上的副热带高压势力较弱，位置偏南，意味着到了黄梅时节，降水可能就会偏少。而江南地区往往是江河湖满，如果不满，必是遇上干旱少雨年。',
              `小满
[现代]吴藕汀
白桐落尽破檐牙，
或恐年年梓树花。
小满田塍寻草药，
农闲莫问动三车。`,
              '小满时节，农事活动也即将进入大忙季节，夏收作物已经成熟，或接近成熟；春播作物生长旺盛；秋收作物播种在即。长江江南早稻已进入分蘖后期或拔节始期，应及时烤田控制无效分蘖，保穗增粒促高产。中稻此时要争取早栽，以利增加养分的积累继而提高有效穗数。'
            ]
          },
          {name: '芒种',
            active: false,
            id: 8,
            pinyin: '[máng zhǒng]',
            time: '2017年6月05日',
            intro: `芒种的“芒”字，是指麦类等有芒植物的收获，芒种的“种”字，是指谷黍类作物播种的节令。“芒种”二字谐音，表明一切作物都在“忙种”了。所以，“芒种”也称为“忙种”，农民间也称其为“忙着种”。“芒种”到来预示着农民开始了忙碌的田间生活。
中国古代将芒种分为三候：“一候螳螂生；二候鹏始鸣；三候反舌无声。”在这一节气中，螳螂在去年深秋产的卵因感受到阴气初生而破壳生出小螳螂；喜阴的伯劳鸟开始在枝头出现，并且感阴而鸣；与此相反，能够学习其它鸟鸣叫的反舌鸟，却因感应到了阴气的出现而停止了鸣叫。`,
            three: ['螳螂生', '鹃始鸣', '反舌无声'],
            detail: [
              `芒种养生，要注意饮食以及生活习惯的改变，注意夏天不要吃太油腻的食物，出门做好防晒工作。可注意以下几点：一是出汗后不可马上洗澡；二是天热下午两点少出门；三是饮食要清淡，少吃荤。`,
              '芒种时节雨量充沛，气温显著升高，同时沿江多雨，黄淮平原也即将进入雨季。华南东南季风雨带稳定，是一年中降水量最多的时节。长江中下游地区先后进入梅雨季节，雨日多，雨量大，日照少，有时还伴有低温。此时，西南西部的高原地区冰雹天气开始增多。',
              `芒种
[西汉]长卿
河阴荠麦芒愈长，
梅子黄时水涨江。
王孙但知闲煮酒，
村夫不忘禾豆忙。`,
              ' 对中国大部分地区来说，芒种一到，夏熟作物要收获，夏播秋收作物要下地，春种的庄稼要管理，“收”、“种”、“管”交叉，是一年中最忙的季节。长江流域“栽秧割麦两头忙”，华北地区“收麦种豆不让晌”，真是“芒种”。'
            ]
          },
          {name: '夏至',
            active: false,
            id: 9,
            pinyin: '[xià zhì]',
            time: '2017年6月21日',
            intro: `夏至是二十四节气中最早被确定的一个节气。公元前七世纪，先人采用土圭测日影，就确定了夏至。
 中国古代将夏至分为三候：“一候鹿角解；二候蝉始鸣；三候半夏生。”麋与鹿虽属同科，但古人认为，二者一属阴一属阳。鹿的角朝前生，所以属阳。夏至日阴气生而阳气始衰，所以阳性的鹿角便开始脱落。而麋因属阴，所以在冬至日角才脱落；雄性的知了在夏至后因感阴气之生便鼓翼而鸣；半夏是一种喜阴的药草，因在仲夏的沼泽地或水田中出生所以得名。由此可见，在炎热的仲夏，一些喜阴的生物开始出现，而阳性的生物却开始衰退了。`,
            three: ['鹿角解', '蜩始鸣', '半夏生'],
            detail: [
              `从夏至开始，阳极阴生，阴气居于内，所以，在夏至后，饮食要以清泄暑热、增进食欲为目的，因此要多吃苦味食物，宜清补。夏至后，气温逐渐升高，人体出汗量也会随之增加，因此人体需水量大。同时精神上要善于调节，多静坐，排除心中杂念。`,
              ' 夏至以后地面受热强烈，空气对流旺盛，午后至傍晚常易形成雷阵雨。这种热雷雨骤来疾去，降雨范围小，人们称“夏雨隔田坎”。多数情况，夏至期间，正值长江中下游、江淮流域梅雨，频频出现暴雨天气，容易形成洪涝灾害。',
              `夏至日作
[唐]权德舆
璿枢无停运，
四序相错行。
寄言赫曦景，
今日一阴生。`,
              '夏至时节，夏播工作要抢时扫尾，已插的力争全苗。出苗后应及时间苗定苗，移栽补缺。各种秋果树此时也需要认真地护果防虫，提高果品质量。而高原牧区则开始了草肥畜旺的美好季节。 '
            ]
          },
          {name: '小暑',
            active: false,
            id: 10,
            pinyin: '[xiǎo shǔ]',
            time: '2017年7月07日',
            intro: `小暑表示季夏时节的正式开始。暑，表示炎热的意思，小暑为小热，还不十分热。意指天气开始炎热，但还没到最热，全国大部分地区基本符合。
  古时小暑分三候：“一候温风至；二候蟋蟀居宇；三候鹰始鸷。”小暑时节，大地上不再有一丝凉风，所有风中都带着热浪；由于炎热，蟋蟀也离开了田野，到庭院的墙角下以避暑热；老鹰也因地面气温太高而在清凉的高空中飞翔。`,
            three: ['温风至', '蟋蜂居壁', '鹰始挚'],
            detail: [
              `小暑时节宜少动多静，保持心态平和、情绪稳定；作息应有规律，睡眠要充足；多吃苦瓜等清热祛暑的蔬菜和水果，多喝汤或粥，同时阳气较为虚弱的群体，同样应适当进补一些温热的食材；选择散步、游泳、瑜珈、太极拳、旅游等方式进行运动。`,
              '小暑前后，江淮流域梅雨结束，中国南方大部分地区各地进入雷暴最多的季节。华南东部，小暑以后因常受副热带高压控制，多连晴高温天气，开始进入伏旱期。中国南方大部分地区则有东旱西涝的气候特点。',
              `小暑六月节
[唐]元稹
倏忽温风至，因循小暑来。
竹喧先觉雨，山暗已闻雷。
户牖深青霭，阶庭长绿苔。
鹰鹯新习学，蟋蟀莫相催。`,
              '小暑前后，除东北与西北地区收割冬、春小麦等作物外，农业生产上主要是忙着田间管理了。早稻处于灌浆后期；中稻已拔节；单季晚稻正在分蘖；双晚秧苗要防治病虫；大部分棉区的棉花在重施花铃肥的同时，要及时整枝、打杈、去老叶。'
            ]
          },
          {name: '大暑',
            active: false,
            id: 11,
            pinyin: '[dà shǔ]',
            time: '2017年7月22日',
            intro: `大暑，是二十四节气中的第十二节气，在每年的阳历7月22日至24日，太阳到达黄经120°，表示天气酷热，最炎热时期到来。
  我国古代将大暑分为三候：“一候腐草为萤;二候土润溽暑;三候大雨时行。”世上萤火虫约有二千多种，分水生与陆生两种，陆生的萤火虫产卵于枯草上，大暑时，萤火虫卵化而出，所以古人认为萤火虫是腐草变成的;第二候是说天气开始变得闷热，土地也很潮湿;第三候是说时常有大的雷雨会出现，这大雨使暑湿减弱，天气开始向立秋过渡。`,
            three: ['腐草为萤', '土润溽暑', '大雨行时'],
            detail: [
              `大暑时节特别要注意防中暑，须注意不要在太阳下暴晒，烈日当顶时不宜出门，勿做剧烈的运动，要保证充足的睡眠。应少量、多次补充水分，可选择淡盐水、绿茶、绿豆汤及其他清凉饮料；在情志方面，夏季养生重点突出“心静”，正所谓“心静自然凉”。`,
              '大暑节气是华南一年中日照最多、气温最高的时期，是华南西部雨水最丰沛、雷暴最常见、30℃以上高温日数最集中的时期，也是华南东部35℃以上高温出现最频繁的时期。大暑也是雷阵雨最多的季节。',
              `消暑
[唐]白居易
何以消烦暑，端坐一院中。
眼前无长物，窗下有清风。
散热有心静，凉生为室空。
此时身自保，难更与人同。`,
              '大暑时节，天气到了最炎热的时期，各种喜温农作物也到了生长最快的季节。东北等地的棉花进入花铃期，大豆到了开花结英的时期，此时都是农作物需要水的高峰期，要注意灌溉补水，要注意农田管理，减少危害损失。'
            ]
          }
        ]
      },
      autumn: {
        id: 2,
        solar: [
          {name: '立秋',
            active: false,
            id: 12,
            pinyin: '[lì qiū]',
            time: '2017年8月07日',
            intro: `每年8月7日或8日视太阳到达黄经135°时为立秋。立秋的“立”是开始的意思，“秋”是指庄稼成熟的时期。立秋表示暑去凉来，秋天开始之意。
  我国古代将立秋分为三候：“一候凉风至；二候白露生；三候寒蝉鸣。”是说立秋过后，刮风时人们会感觉到凉爽，此时的风已不同于暑天中的热风；接着，大地上早晨会有雾气产生；并且秋天感阴而鸣的寒蝉也开始鸣叫。`,
            three: ['凉风至', '白露降', '寒蝉鸣'],
            detail: [
              `在雨水节气之后，随着降雨有所增多，寒湿之邪最易困着脾脏。同时湿邪留恋，难以去除，故雨水前后应当着重养护脾脏。其次，要注意健脾利湿。内以养护脾气，外以清利湿邪，从而达到养脾的目的。雨水时节，还要预防“倒春寒”，春寒料峭，湿气一般夹“寒”而来，因此雨水前后必须注意保暖，切勿受凉。同时少食生冷之物。`,
              '中国地域辽阔，虽各地气候有差别，但此时大部分地区仍未进入秋天气候，况且每年大热三伏天的末伏还在立秋后第3日。尤其是中国南方此节气内还是夏暑之时，同时由于台风雨季节渐去了，气温更酷热。',
              `七绝·立秋
[当代]徐书信
池水渐凉蝉唱稀，
长空雁阵岭南飞。
与君携手花间舞，
夜露沾鞋又湿衣。`,
              '立秋前后中国大部分地区气温仍然较高，各种农作物生长旺盛，中稻开花结实，单晚圆秆，大豆结荚，玉米抽雄吐丝，棉花结铃，甘薯薯块迅速膨大，对水分要求都很迫切，此期受旱会给农作物最终收成造成难以补救的损失。'
            ]
          },
          {name: '处暑',
            active: false,
            id: 13,
            pinyin: '[chù shǔ]',
            time: '2017年8月23日',
            intro: `太阳到达黄经150°时是农历二十四节气的处暑。处暑是反映气温变化的一个节气。“处”含有躲藏、终止意思，“处暑”表示炎热即将过去，暑气将于这一天结束。
  我国古代将处暑分为三候：“一候鹰乃祭鸟；二候天地始肃；三候禾乃登。”此节气中老鹰开始大量捕猎鸟类；天地间万物开始凋零；禾乃登的禾指的是黍、稷、稻、粱类农作物的总称，登即成熟的意思。`,
            three: ['鹰乃祭鸟', '天地始肃', '禾乃登'],
            detail: [
              `从养生的角度来看，处暑节气适宜进食清热安神的食物，如银耳、百合、糯米、芝麻、豆类及奶类等，但要少食多餐。另外，随着气侯渐渐干燥，人体肺经当值，这时可多吃滋阴润燥食物，防止燥邪损伤，如梨、冰糖、银耳、沙参、鸭子等养阴生津的食物。`,
              ' 处暑节气，单单用气温开始走低来描述是不够的。气温走低仅是其中的一个现象。产生这一现象背后的原因，首先应是太阳的直射点继续南移，太阳辐射减弱；二是副热带高压跨越式地向南撤退，蒙古冷高压开始跃跃欲试，出拳出脚，小露锋芒。',
              `处暑
[现代]左河水
一度暑出处暑时，
秋风送爽已觉迟。
日行南径斜晖里，
割稻陌阡车马驰。`,
              '处暑时节连作晚稻正处于拔节、孕穗期，是最需要肥料和水的关键时期，要注意灌好“养胎水”，施好“保花肥”，并加强以防治稻飞虱和白叶枯病为主的田间管理，还要做好降温防暑和抗台风工作和动物秋季防疫工作。'
            ]
          },
          {name: '白露',
            active: false,
            id: 14,
            pinyin: '[bái lù]',
            time: '2017年9月07日',
            intro: `白露是农历二十四节气之一，当太阳到达黄经一百六十五度时交白露节气。《月令七十二候集解》中说：“八月节……阴气渐重，露凝而白也。” 天气渐转凉，会在清晨时分发现地面和叶子上有许多露珠，这是因夜晚水汽凝结在上面，故名。古人以四时配五行，秋属金，金色白，故以白形容秋露。白露是秋天的第三个节气，表示孟秋时节的结束和仲秋时节的开始。
  我国古代将白露分为三候：“一候鸿雁来；二候元鸟归；三候群鸟养羞。”说的是此节气正是鸿雁与燕子等候鸟南飞避寒，百鸟开始贮存干果粮食以备过冬。`,
            three: ['鸿雁来', '玄鸟归', '群鸟养羞'],
            detail: [
              `白露时节养生要做到：
防秋寒：要注重运动锻炼，也要讲究耐寒锻炼。
防乱补：不要盲目进补，可以吃一点乌骨鸡汤、蜂蜜、芝麻、花生之类性平的食物。
防肥胖：到秋天的话天气转凉了，胃口也好了，食欲大增，往往饮食过多。
防伤害：秋令时节我们还是要坚持锻炼，运动时要防受凉感冒、运动损伤和运动过度`,
              '白露时节，中国北方地区降水明显减少，秋高气爽，比较干燥。西南地区东部、华南和华西地区也往往出现连阴雨天气。东南沿海，特别是华南沿海还可能会有热带天气系统(台风)造成的大暴雨。部分地区还有可能出现秋旱、森林火险、初霜等天气。',
              `凉夜有怀
[唐]白居易
清风吹枕席，
白露湿衣裳。
好是相亲夜，
漏迟天气凉。`,
              '白露时节冷空气日趋活跃，常出现秋季低温天气，影响晚稻抽穗扬花，因此要预防低温冷害和病虫害。冷空气入侵时，可采用灌水保温，低温之前灌水二寸以上，可增温1~2℃。低温来时，晴天可日排夜灌浅水；阴雨天则要灌厚水。'
            ]
          },
          {name: '秋分',
            active: false,
            id: 15,
            pinyin: '[qiū fèn]',
            time: '2017年9月23日',
            intro: `我国古籍《春秋繁露·阴阳出入上下篇》中说：“秋分者，阴阳相半也，故昼夜均而寒暑平。”秋分之“分”为“半”之意。“秋分”的意思有二： 一是，昼夜时间均等，并由昼长夜短变为昼短夜长。二是，气候由热转凉。秋分在每年公历的9月22日，23日或24日，为中国传统节日中的二十四节气之一，此时太阳到达黄经180度。
  我国古代将秋分分为三候：“一候雷始收声；二候蛰虫坯户；三候水始涸。”古人认为雷是因为阳气盛而发声，秋分后阴气开始旺盛，所以不再打雷了。`,
            three: ['雷始收声', '蛰虫坯户', '水始涸'],
            detail: [
              ` 秋分节气要防止凉燥，即坚持锻炼身体，增强体质，提高抗病能力。饮食调养方面，应多喝水，吃清润、温润的食物，如芝麻、核桃、梨等。精神调养方面，最主要的是培养乐观情绪，保持神志安宁。`,
              '秋分时节，我国大部分地区已经进入凉爽的秋季，南下的冷空气与逐渐衰减的暖湿空气相遇，产生一次次的降水，气温也一次次地下降。正如人们常所说的那样，已经到了“一场秋雨一场寒”的时候，但秋分之后的日降水量不会很大。',
              `秋分
[现代]左河水
暑退秋澄气转凉，
日光夜色两均长。
银棉金稻千重秀，
丹桂小菊万里香。`,
              '秋分节气是秋收、秋耕、秋种的“三秋”大忙时机，是秋熟作物灌浆和产量形成的最后关键时期，秋分农事活动非常关键，例如中稻要加强后期水浆管理，新棉要分期采摘，家畜要秋季配种等等。'
            ]
          },
          {name: '寒露',
            active: false,
            id: 16,
            pinyin: '[hán lù]',
            time: '2017年10月08日',
            intro: `寒露表示秋季时节的正式开始，时间在公历每年10月7日~9日，此时太阳到达黄经195度。《月令七十二候集解》说：“九月节，露气寒冷，将凝结也。”寒露的意思是气温比白露时更低，地面的露水更冷，快要凝结成霜了。
我国将寒露分为三候：“一候鸿雁来宾；二候雀入大水为蛤；三候菊有黄华。”此节气中鸿雁排成一字或人字形的队列大举南迁；深秋天寒，雀鸟都不见了，古人看到海边突然出现很多蛤蜊，并且贝壳的条纹及颜色与雀鸟很相似，所以便以为是雀鸟变成的；第三候的“菊始黄华”是说在此时菊花已普遍开放。`,
            three: ['鸿雁来宾', '雀入大水为蛤', '菊有黄花'],
            detail: [
              `寒露时节，饮食养生应在平衡饮食五味基础上，根据个人的具体情况，适当多食甘、淡滋润的食品，。同时室内要保持一定的湿度，注意补充水分，多吃雪梨、香蕉、哈密瓜、苹果等水果。此外还应重视涂擦护肤霜等以保护皮肤，防止干裂。`,
              '寒露节气的一个特点是气温降得快。一场较强的冷空气带来的秋风、秋雨过后，温度下降8℃、10℃已较常见。不过，风雨天气大多维持时间不长(华西地区除外)，受冷高压的控制，昼暖夜凉，白天往往秋高气爽。',
              `池上
[唐]白居易
袅袅凉风动，凄凄寒露零。
兰衰花始白，荷破叶犹青。
独立栖沙鹤，双飞照水萤。
若为寥落境，仍值酒初醒。`,
              '寒露时节温度低，昼夜温差大，利于麦苗、秋菜等作物的生长。而且寒露时节是秋收、秋种、秋管的重要时期，寒露的到来意味着许多农事需加紧进行，否则会影响到来年的丰收情况。由于地域不同，南北方农事各不相同。'
            ]
          },
          {name: '霜降',
            active: false,
            id: 17,
            pinyin: '[shuāng jiàng]',
            time: '2017年10月23日',
            intro: `霜降，二十四节气之一，每年公历10月23日左右，霜降节气含有天气渐冷、初霜出现的意思，是秋季的最后一个节气，也意味着冬天即将开始。
霜降有三候：“一候豺乃祭兽;二候草木黄落;三候蛰虫咸俯。”关于霜降的第一候，一种说法是，人们在这个节气中捕获猎物，以兽祭天;另一种说法是，豺狼将捕获的猎物先陈列，之后再食用。随后，在黄河流域，树叶开始枯黄掉落，蛰虫也开始伏在洞穴中，准备进入冬眠。`,
            three: ['豺乃祭兽', ' 草木黄落', '蛰虫咸俯'],
            detail: [
              `霜降养生，在饮食方面应淡补，不要在食物中放太多的盐；起居方面要注意，穿衣保暖，早晨莫贪睡，特别要注意脚部和胃部保暖；而在运动时要注意动与静的合理安排，运动量可适当加大，可选择登高、踢球等运动。`,
              '霜降时节，纬度偏南的南方地区，平均气温多在16℃左右，离初霜日期还有三个节气。在华南南部河谷地带，则要到隆冬时节，才能见霜。同时凉爽的秋风已吹到花城广州。东北北部、内蒙东部和西北大部平均气温已在0℃以下。',
              `赋得九月尽(秋字)
[唐]元稹
霜降三旬后，蓂馀一叶秋。
玄阴迎落日，凉魄尽残钩。
半夜灰移琯，明朝帝御裘。
潘安过今夕，休咏赋中愁。`,
              '霜降节气是大秋作物最后完成收获的季节。长江中下游及以南的地区此时正值冬麦播种的黄金季节。油菜一般已进入二叶期。霜降过后，我国南方大部分地区开始大量收挖红苕；华北地区霜降后，到了收获大白菜的时候。'
            ]
          }
        ]
      },
      winter: {
        id: 3,
        solar: [
          {name: '立冬',
            active: false,
            id: 18,
            pinyin: '[lì dōng]',
            time: '2017年11月07日',
            intro: `立，建始也，表示冬季自此开始。冬是终了的意思，有农作物收割后要收藏起来的含意，中国又把立冬作为冬季的开始。
立冬有三候： “一候水始冰；二候地始冻；三候雉人大水为蜃。”说的是此节气水已经能结成冰；土地也开始冻结；“雉人大水为蜃”中的雉即指野鸡一类的大鸟，蜃为大蛤，立冬后，野鸡一类的大鸟便不多见了，而海边却可以看到外壳与野鸡的线条及颜色相似的大蛤。所以古人认为雉到立冬后便变成大蛤了。`,
            three: ['水始冻', '地始冻', '雉入大水为蜃'],
            detail: [
              `立冬后，就意味着冬季正式来临。草木凋零，蛰虫休眠，万物活动趋向休止。人类虽没有冬眠之说，但中国民间却有立冬补冬的习俗。在寒冷的天气中，应该多吃一些温热补益的食物这样，不仅能使身体更强壮，还可以起到很好的御寒作用。`,
              '立冬时节，太阳已到达黄经225度，我们所处的北半球获得太阳的辐射量越来越少，但由于此时地表在下半年贮存的热量还有一定的能量，所以一般还不会太冷，但气温逐渐下降。在晴朗无风之时，常会出现风和日丽、温暖舒适的十月“小阳春”天气。',
              `立冬
[现代]左河水
北风往复几寒凉，
疏木摇空半绿黄。
四野修堤防旱涝，
万家晒物备收藏。`,
              '立冬前后，东北地区大地封冻，农林作物进入越冬期；江淮地区“三秋”已接近尾声；江南正忙着抢种晚茬冬麦，抓紧移栽油菜；而华南却是“立冬种麦正当时”的最佳时期。另外，立冬后空气一般渐趋干燥，土壤含水较少，要开始重视林区的防火工作。'
            ]
          },
          {name: '小雪',
            active: false,
            id: 19,
            pinyin: '[xiǎo xuě]',
            time: '2017年11月22日',
            intro: `小雪是二十四节气中的第20个节气。起点于每年公历11月22日或23日，太阳位于赤纬-20°16'，到达黄经240°。“小雪”是反映天气现象的节令。古籍《群芳谱》中说：“小雪气寒而将雪矣，地寒未甚而雪未大也。”
 我国古代将小雪分为三候：“一候虹藏不见；二候天气上升地气下降；三候闭塞而成冬。”由于天空中的阳气上升，地中的阴气下降，导致天地不通，阴阳不交，所以万物失去生机，天地闭塞而转入严寒的冬天。`,
            three: ['虹藏不见', '天气上升', '闭塞而成冬'],
            detail: [
              `小雪节气饮食对正常人来说，应当遵循“秋冬养阴”，“无扰乎阳”的原则，既不宜生冷，也不宜燥热，最宜食用滋阴潜阳，热量较高的膳食为宜。同时要注重情志调养，还要慎防内火 宜多吃“苦”味食品。`,
              '小雪节气，东亚地区已建立起比较稳定的经向环流，西伯利亚地区常有低压或低槽，东移时会有大规模的冷空气南下，我国东部会出现大范围大风降温天气。小雪节气是寒潮和强冷空气活动频数较高的节气。强冷空气影响时，常伴有入冬第一次降雪。',
              `小雪
[现代]左河水
太行初雪带寒风，
一路凋零下赣中。
菊萎东篱梅暗动，
方知大地转阳升。
              `,
              '小雪节气期间，北方各地最低气温多在零下，应该做好牲畜的防寒保暖工作。长江中下游地区在小雪节气期间开始了小麦、油菜的田间管理，并开始积肥。南方要注意初霜冻天气。风干物燥，大地草木枯黄，要加强森林防火工作。'
            ]
          },
          {name: '大雪',
            active: false,
            id: 20,
            pinyin: '[dà xuě]',
            time: '2017年12月07日',
            intro: `大雪标志着仲冬时节的正式开始；其时视太阳到达黄经255度。《月令七十二候集解》说：“大雪，十一月节，至此而雪盛也。”大雪的意思是天气更冷，降雪的可能性比小雪时更大了，并不指降雪量一定很大。
 我国古代将大雪分为三候：“一候鹃鸥不呜；二候虎始交；三候荔挺出。”这是说此时因天气寒冷，寒号鸟也不再呜叫了；由于此时是阴气最盛时期，正所谓盛极而衰，阳气已有所萌动，所以老虎开始有求偶行为；“荔挺”为兰草的一种，也感到阳气的萌动而抽出新芽。`,
            three: ['鹖鴠不鸣', '虎始交', '荔挺出'],
            detail: [
              `大雪之后，寒冬来临。中医认为，人体的头、胸、脚这三个部位最容易受寒冷侵袭，是保暖的重点。例如戴一顶帽子，大约减少头部散失热量的60%；用长围巾系在胸口护胸，可以减少寒冷对心脏、脾胃的冲击；长袜、厚靴、睡前足浴在温暖双脚的同时，也促进了人体内的气血流动。`,
              '大雪时节，除华南和云南南部无冬区外，我国大部分地区已进入冬季，东北、西北地区平均气温已达-10℃以下，黄河流域和华北地区气温也稳定在0℃以下。南方地区冬季气候温和而少雨雪，平均气温较长江中下游地区约高2℃至4℃。',
              `农谚：
大雪不冻倒春寒
大雪晴天，立春雪多
大雪不寒明年旱
大雪下雪，来年雨不缺
寒风迎大雪，三九天气暖`,
              '大雪节气期间各地要加强冬小麦、油菜等春花作物的田间管理，查苗补缺，中耕松土，早施苗肥，培育壮苗。随着隆冬季节的临近，着手做好菜苗、果树、苗木、花卉与家畜的保暖工作。'
            ]
          },
          {name: '冬至',
            active: false,
            id: 21,
            pinyin: '[dōng zhì]',
            time: '2017年12月22日',
            intro: `冬至又名“一阳生”，是中国农历中一个重要的节气，也是中华民族的一个传统节日，冬至俗称“数九、冬节”、“长至节”、“亚岁”等。早在二千五百多年前的春秋时代，中国就已经用土圭观测太阳，测定出了冬至。
 我国古代将冬至分为三候：“一候蚯蚓结；二候糜角解；三候水泉动。”传说蚯蚓是阴曲阳伸的生物，此时阳气虽已生长，但阴气仍然十分强盛，土中的蚯蚓仍然蜷缩着身体；糜与鹿同科，却阴阳不同，古人认为糜的角朝后生，所以为阴，而冬至一阳生，糜感阴气渐退而解角；由于阳气初生，所以此时山中的泉水可以流动并且温热。`,
            three: ['蚯蚓结', '麇角解', '水泉动'],
            detail: [
              `冬至养生要做到：第一步，应做好精神调养；第二步，要节欲保精；第三步，要加强身体锻炼；第四步，便是顺应四时，做好饮食调养。从中医养生学的角度看，冬至是“冬令进补”的大好时节。`,
              '天文学上把冬至作为冬季的开始，这对于我国多数地区来说，显然偏迟。冬至日是一年中白天时间最短的一天。从气候上看，冬至期间，西北高原平均气温普遍在0℃以下，南方地区也只有6℃至8℃左右。',
              `冬至
[现代]左河水
西北风袭百草衰，
几番寒起一阳来。
白天最是时光短，
却见金梅竞艳开。`,
              '冬至前后是兴修水利，大搞农田基本建设、积肥造肥的大好时机，同时要施好腊肥，做好防冻工作。江南地区更应加强冬作物的管理，做好清沟排水，培土壅根，对尚未犁翻的冬壤板结要抓紧耕翻，以疏松土壤，增强蓄水保水能力，并消灭越冬害虫。'
            ]
          },
          {name: '小寒',
            active: false,
            id: 22,
            pinyin: '[xiǎo hán]',
            time: '2018年1月05日',
            intro: `小寒，为农历二十四节气中的第23个节气，也是冬季的第五个节气，标志着季冬时节的正式开始。当太阳到达黄经285°时，对于神州大地而言，标志着一年中最寒冷的日子到来了。
 我国古代将小寒分为三候：“一候雁北乡，二候鹊始巢，三候雉始鸲。”古人认为候鸟中大雁是顺阴阳而迁移，此时阳气已动，所以大雁开始向北迁移；此时北方到处可见到喜鹊，并且感觉到阳气而开始筑巢；第三候“雉鸲”的“鸲”为鸣叫的意思，雉在接近四九时会感阳气的生长而鸣叫。`,
            three: ['雁北乡', '鹊始巢', '雉雊'],
            detail: [
              `小寒时节，中医认为寒为阴邪，最寒冷的节气也是阴邪最盛的时期，从饮食养生的角度讲，要特别注意在日常饮食中多食用一些温热食物以补益身体，防御寒冷气候对人体的侵袭。`,
              '小寒时，中国南方地区冬暖显著，隆冬1月，霜雪交侵，常有冰冻，最低气温在零下10℃左右。而华南北部最低气温却很少低于零下5℃，华南南部0℃以下的低温更不多见。中国隆冬最冷的地区是黑龙江北部，最低气温在可达零下40℃左右。',
              `小寒
              [现代]左河水
              冰封万里雪皑皑，
              径堵千重港口塞。
              昨日剪桃修几树，
              忽如一夜李花开。`,
              '小寒时节，要继续抓好春花作物的培育，做好防冻、防湿工作，力争春花好收成。要防止积雪冻雨压断和竹林果木，冬季多大雾、大风天，海上或江湖捕鱼、养殖作业需特别注意安全。'
            ]
          },
          {name: '大寒',
            active: false,
            id: 23,
            pinyin: '[dà hán]',
            time: '2018年1月20日',
            intro: `大寒是二十四节气中最后一个节气，每年1月20日前后太阳到达黄经300°时为“大寒”。大寒，是天气寒冷到极点的意思。《授时通考·天时》引《三礼义宗》：“大寒为中者，上形于小寒，故谓之大......寒气之逆极，故谓大寒。”
 我国古代将大寒分为三候：“一候鸡乳；二候征鸟厉疾；三候水泽腹坚。”  就是说到大寒节气便可以孵小鸡了；而鹰隼之类的征鸟，却正处于捕食能力极强的状态中，盘旋于空中到处寻找食物，以补充身体的能量抵御严寒；在一年的最后五天内，水域中的冰一直冻到水中央，且最结实、最厚。`,
            three: ['鸡乳', '征鸟厉疾', '水泽腹坚'],
            detail: [
              `大寒正值寒冬季节，天气严寒易冻伤手脚，预防方法是穿暖防寒。鞋袜要松软防风，以免影响气血供应。阳虚之体，怕冷、手足发凉、脉沉而弱，吃饭要多吃羊肉、狗肉等温热食品，还要锻炼身体增强抵抗力，局部多按摩，也可捈冻疮膏。`,
              ' 大寒时节，常出现大范围雨雪天气和大风降温。当东经80度以西为长波脊，东亚为沿海大槽，我国受西北风气流控制及不断补充的冷空气影响便会出现持续低温。同小寒一样，大寒也是表示天气寒冷程度的节气。',
              `大寒
              [现代]左河水
              蜡树银山炫皎光，
              朔风独啸静三江。
              老农犹喜高天雪，
              况有来年麦果香。`,
              '大寒节气里，各地农活依旧很少。北方地区老百姓多忙于积肥堆肥，为开春作准备；或者加强牲畜的防寒防冻。南方地区则仍加强小麦及其他作物的田间管理。 除此以外，各地人们还以大寒气候的变化预测来年雨水及粮食丰歉情况，便于及早安排农事。'
            ]
          }
        ]
      }
    }
  },
  methods: {
    update () {  // 设置当前季节与活动节气
      var id = this.$route.params.id
      if (id < 6) {
        this.currentSeason = this.spring
      } else if (id < 12) {
        this.currentSeason = this.summer
      } else if (id < 18) {
        this.currentSeason = this.autumn
      } else {
        this.currentSeason = this.winter
      }
      this.currentSeason.solar[id % 6].active = true
      this.currentSolar = this.currentSeason.solar[id % 6]
    },
    wheelHandler (e) {
      var left = getMousewheelDirection(e);
      var current = parseInt(this.$route.params.id)
      if (left && current !== 0) {
        this.$router.push('/solar/' + (current - 1))
      } else if (!left && current !== 23) {
        this.$router.push('/solar/' + (current + 1))
      }
    }
  },
  created () {
    this.update()
    window.addEventListener('mousewheel',this.wheelHandler);
    window.addEventListener('DOMMouseScroll',this.wheelHandler);
  },
  mounted(){
    console.log(this.$el);
  },
  watch: {
    '$route' (to, from) {
      console.log(window.aaa);
      if (to.params.id !== from.params.id) {  //切换节气
        this.currentSeason.solar[from.params.id % 6].active = false
        this.update()
      }
      if (from.params.detail_id && !to.params.detail_id) {  //从详情model返回，夺回onmousewheel
        window.addEventListener('mousewheel',this.wheelHandler);
        window.addEventListener('DOMMouseScroll',this.wheelHandler);
      }else if(!from.params.detail_id && to.params.detail_id){  //打开model
        window.removeEventListener('mousewheel',this.wheelHandler);
        window.removeEventListener('DOMMouseScroll',this.wheelHandler);
      }
    }
  }

}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
</style>
